# RbsWireTemperatureRatingParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsWireTemperatureRatingParam Property
ParameterTypeId Class See Also
---
"Temperature Rating"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsWireTemperatureRatingParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsWireTemperatureRatingParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsWireTemperatureRatingParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace